#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```data.aws_subnet.public_subnet_data: Reading...
data.aws_security_group.vpc_sg_data: Reading...
module.ec2_instance.data.aws_partition.current: Reading...
aws_ecr_repository.ecr_repo: Refreshing state... [id=azmi1-nodejs-app]
module.ec2_instance.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_ami.aws_ami_data: Reading...
data.aws_subnet.public_subnet_data: Read complete after 0s [id=subnet-076c22fe216f37497]
data.aws_security_group.vpc_sg_data: Read complete after 0s [id=sg-0d6bfc561f5620e5f]
data.aws_ami.aws_ami_data: Read complete after 0s [id=ami-0fff1b9a61dec8a5f]
module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-0a744eadbdc2c1fae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_repository.ecr_repo will be destroyed
  # (because aws_ecr_repository.ecr_repo is not in configuration)
  - resource "aws_ecr_repository" "ecr_repo" {
      - arn                  = "arn:aws:ecr:us-east-1:255945442255:repository/azmi1-nodejs-app" -> null
      - id                   = "azmi1-nodejs-app" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "azmi1-nodejs-app" -> null
      - registry_id          = "255945442255" -> null
      - repository_url       = "255945442255.dkr.ecr.us-east-1.amazonaws.com/azmi1-nodejs-app" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # aws_ecrpublic_repository.ecr_repo will be created
  + resource "aws_ecrpublic_repository" "ecr_repo" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "azmi1-nodejs-app"
      + repository_uri  = (known after apply)
      + tags_all        = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @RaytraceSG, Action: `pull_request`, Workflow: `Terraform Checks`*